Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/birth_family_relationships/separation_and_divorce/succession.html.txt.tmx
Source language: en
Languages: ga

source: Succession rights following a separation/divorce/dissolution
ga: Cearta comharbais i ndiaidh idirscartha/colscartha/scaoilte

source: Succession relates to the inheritance of a person's property on their death
ga: Baineann comharbas le maoin duine a fháil le hoidhreacht ar a mbás

source: It is governed by the Succession Act 1965
ga: Déantar é a rialú ag an Acht Comharbais, 1965

source: The Act gives the surviving spouse/civil partner an automatic right to a share in the estate of their deceased spouse/civil partner
ga: Tugtar san Acht ceart uathoibríoch don chéile/pháirtnéir sibhialta marthanach i leith scaire d’eastát a gcéile/a bpáirtnéara shibhialta mhairbh a fháil

source: The share to which the spouse/civil partner is entitled is often called “a legal right share”
ga: Is minic go dtugtar “scair chirt dhlíthiúl” ar an scair a bhíonn an céile/páirtnéir sibhialta i dteideal a fháil

source: The surviving spouse/civil partner is legally entitled to the appropriate share regardless of the actual terms of the will
ga: Tá teidlíocht dhlíthiúil ag an gcéile/bpáirtnéir sibhialta marthanach i leith na scaire cuí, gan aird ar théarmaí iarbhír na huachta

source: The fact that the parties may have lived apart for many years does not of itself affect their entitlements under the Act
ga: Ní dhéanann sé difear dá dteidlíochtaí faoin Acht má chónaigh na páirtithe amach óna chéile ar feadh go leor blianta

source: Succession rights can be renounced voluntarily by either or both spouses/civil partners in a separation agreement
ga: Is féidir le ceachtar céile/páirtnéir sibhialta an bheirt díobh cearta comharbais a thréigean go deonach i gcomhaontú idirscartha

source: In granting a decree of judicial separation, a court can extinguish a spouse's succession rights if it is satisfied that adequate provision exists for the spouse whose rights are being extinguished
ga: Nuair a dheonaítear foraithne idirscartha bhreithiúnaigh, féadfaidh cúirt cearta comharbais céile a chealú má tá an chúirt sásta gurb ann do sholáthar leordhóthanach don chéile a bhfuil a c(h)earta á gcealú

source: Once a decree of divorce/dissolution is granted, the parties are no longer married or in a civil partnership, and succession rights are automatically extinguished
ga: A luaithe a dheonaítear foraithne cholscartha/scaoilte, níl na páirtithe pósta a thuilleadh nó i bpáirtnéireacht shibhialta, agus déantar cearta comharbais a chealú go huathoibríoch

source: A divorced spouse or a civil partner whose civil partnership has been dissolved can make an application to court seeking a share of the estate of their former spouse/civil partner, provided that the application is made within six months of the date of the Grant of Probate or Administration and the divorced spouse/civil partner has not remarried or entered into a new civil partnership
ga: Féadfaidh céile nó páirtnéir sibhialta colscartha a ndearnadh a p(h)áirtnéireacht shibhialta a scaoileadh iarratas a dhéanamh ar chúirt ina lorgaítear scair d’eastát a n-iarchéile/a n-iarpháirtnéara shibhialta, a fhad agus go ndéantar an t-iarratas laistigh de shé mhí i ndiaidh dháta Dheonú na Probháide nó an Riartha agus a fhad nach ndearnadh an chéile/páirtnéir sibhialta colscartha a athphósadh nó nár iontráil sé/sí isteach i bpáirtnéireacht shibhialta nua

source: Further information on succession rights is available in our document on what happens the deceased's estate
ga: Tá fáil ar thuilleadh faisnéise ar chearta comharbais inár gcáipéisí ar cad a tharlaíonn d’eastát an mhairbh
